MaroshCZ/Power-Supply-USB-C/STM32G0_USBPD_Sink_1.2/Application/app.c
	if (ocp_reset_needed == 1) {
		HAL_GPIO_WritePin(OCP_RESET_GPIO_Port, OCP_RESET_Pin, GPIO_PIN_RESET);
		HAL_Delay(4); //datasheet says 100ns minimum pull down time for resettin alert, but for me even 1ms was not enough
		HAL_GPIO_WritePin(OCP_RESET_GPIO_Port, OCP_RESET_Pin, GPIO_PIN_SET);
		ocp_reset_needed = 0;
	}


	switch(outputState)
		{
			case(OUTPUT_OFF_STATE):
			{
				switch(currentState)
					{
					case(ADJUSTMENT_VOLTAGE):
					{
						//Blink currently selected digit
						max7219_BlinkDigit(SEGMENT_1, &dhandle->voltageSet, dhandle->encoder.selDigit, 500, 3); //pass voltage address to BlinkDigit function
					}
					 break;
					case(ADJUSTMENT_CURRENT):
					{
						//Blink currently selected digit
						max7219_BlinkDigit(SEGMENT_2, &dhandle->currentSet, dhandle->encoder.selDigit, 500, 4); //pass voltage address to BlinkDigit function
					}
					break;
					case(ADJUSTMENT_CURRENT_OCP):
					{

						//Blink currently selected digit
						max7219_BlinkDigit(SEGMENT_2, &dhandle->currentOCPSet, dhandle->encoder.selDigit, 500, 4); //pass voltage address to BlinkDigit function
					}
					break;
					}

			}
			break;

			case(OUTPUT_ON_STATE):
			{
				uint32_t vol = BSP_PWR_VBUSGetVoltage(0)/10; //divide by 10 t oget centivolts since only 4 digit display..
				uint32_t cur = BSP_PWR_VBUSGetCurrent(0);

				dhandle ->currentMeas = cur;
				dhandle ->voltageMeas = vol;
				//Display output voltage
				max7219_PrintIspecial(SEGMENT_1, vol, 3);

				//Display output current
				max7219_PrintIspecial(SEGMENT_2, cur, 4);

				HAL_Delay(500);

			}
			break;
		}

	//CDC_Transmit_FS(data, strlen(data));

}

/**
 * Update ADC CH3 AWD Treshold
 */
void Update_AWD_Thresholds(uint32_t low, uint32_t high) {
    HAL_ADC_Stop(&hadc1);  // Stop ADC before updating thresholds
    HAL_ADC_AnalogWDGConfig(&hadc1, &(ADC_AnalogWDGConfTypeDef){
        .WatchdogMode = ADC_ANALOGWATCHDOG_SINGLE_REG,
        .Channel = ADC_CHANNEL_3, //isense (MCP06C20)
        .ITMode = ENABLE,
        .HighThreshold = high,
        .LowThreshold = low
    });
    HAL_ADC_Start(&hadc1);  // Restart ADC
}

// Helper function to update voltage
void updateVoltage(SINKData_HandleTypeDef *handle) {
	//Get direction of encoder turning
	int voltageTemp = handle->voltageSet;
	voltageTemp += handle->encoder.direction * handle->encoder.increment;

	//If required temp value is within limits, assign it to voltage else assign limits
	if (voltageTemp > handle->voltageMax) {
		handle->voltageSet = handle->voltageMax;

	} else if (voltageTemp < handle->voltageMin) {
		handle->voltageSet = handle->voltageMin;

	} else {
		handle->voltageSet = voltageTemp;
	}

	//Print selected voltage to disp, decimal at digit 3
	max7219_PrintIspecial(SEGMENT_1, handle->voltageSet, 3);

	//Print to debug
	char _str[40];
	sprintf(_str,"VBUS selected: %d mV", handle->voltageSet*10);
	USBPD_TRACE_Add(USBPD_TRACE_DEBUG, 0, 0, (uint8_t*)_str, strlen(_str));

}

// Helper function to update voltage
void updateCurrent(SINKData_HandleTypeDef *handle) {
	//Get direction of encoder turning
	int currentTemp = handle->currentSet;
	currentTemp += handle->encoder.direction * handle->encoder.increment;

	//If required temp value is within limits, assign it to voltage else assign limits
	if (currentTemp > handle->currentMax) {
		handle->currentSet = handle->currentMax;

	} else if (currentTemp < handle->currentMin) {
		handle->currentSet = handle->currentMin;

	} else {
		handle->currentSet = currentTemp;
	}

	//Update AWD limits
	int isense_Vtrip_mV = (handle->currentSet *G_SENSE*R_SENSE_MOHMS)/1000; // mV  (mA * mOhms * Gain)
	int isense_rawADCtrip= (V_TRIP *4095) / VDDA_APPLI; //value for AWD tershold
	Update_AWD_Thresholds(0, isense_rawADCtrip);

	//Print selected voltage to disp, decimal at digit 3
	max7219_PrintIspecial(SEGMENT_2, handle->currentSet, 4);

	//Print to debug
	char _str[40];
	sprintf(_str,"IBUS selected: %d mA", handle->currentSet);
	USBPD_TRACE_Add(USBPD_TRACE_DEBUG, 0, 0, (uint8_t*)_str, strlen(_str));
}

// Helper function to update voltage
void updateCurrentOCP(SINKData_HandleTypeDef *handle) {
	//Get direction of encoder turning
	int currentTemp = handle->currentOCPSet;
	currentTemp += handle->encoder.direction * handle->encoder.increment;

	//If required temp value is within limits, assign it to voltage
	if ( (handle->currentMin <= currentTemp) && (currentTemp <= handle->currentMax) ) {
		handle->currentOCPSet = currentTemp;
	} else {
		//currentOCPTemp = currentOCP;
	}

	int V_TRIP = (handle->currentOCPSet * R_OCP_MOHMS * G_OCP)/1000; // mV (mA * mOhms * Gain)
	//Convert DAC_OUT voltage to 12B resolution
	int dac_value = (V_TRIP *4095) / VDDA_APPLI;//__LL_ADC_DIGITAL_SCALE(LL_ADC_RESOLUTION_12B);
	//Write output with DAC..
	HAL_DAC_SetValue(&hdac1, DAC_CHANNEL_1, DAC_ALIGN_12B_R, dac_value);

	//Print selected voltage to disp, decimal at digit 3
	max7219_PrintIspecial(SEGMENT_2, handle->currentOCPSet, 4);

	//Print to debug
	char _str[40];
	sprintf(_str,"IOCP selected: %d mA", handle->currentOCPSet);
	USBPD_TRACE_Add(USBPD_TRACE_DEBUG, 0, 0, (uint8_t*)_str, strlen(_str));

}

/**
 * TIM2 encoder turning interrupt service routine
 */
void encoder_turn_isr(void) {
	//Get the TIM3 (encoder) value from CNT register
	encoderVal = (TIM3 -> CNT) >> 2;

	dhandle->encoder.curValue= encoderVal;

	if (encoderVal != dhandle->encoder.prevValue){

		dhandle->encoder.direction = (encoderVal < dhandle->encoder.prevValue) ? 1 : -1;

		switch(currentState)
		{
		case ADJUSTMENT_VOLTAGE:
		{
			updateVoltage(dhandle);
		}
		break;

		case ADJUSTMENT_CURRENT:
		{
			updateCurrent(dhandle);

		}
		break;

		case ADJUSTMENT_CURRENT_OCP:
		{
			updateCurrentOCP(dhandle);
		}
		break;

		}

		//Save TIM2 CNT value to ValPrev
		dhandle->encoder.prevValue = encoderVal;
	}
}


/**
 * Button interrupt service routine
 */
void enc_toggle_units_isr(void){
	/*
	const char response[] = "POWER is ON\r\n";
	        LPUART_Transmit(LPUART2, (const uint8_t*)response, sizeof(response) - 1);*/

	//Mask unwanted button interrupts caused by debouncing on exti line 3 (PD8)
	EXTI->IMR1 &= ~(EXTI_IMR1_IM8);

	//Set debouncing time in ms
	TIM7->ARR = 200;

